app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_artist
    @artist = Artist.find params[:id]