app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE (title ILIKE '%csasc%')
---
  def search
    @songs = Song.search params[:search]

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def set_artist
    @artist = Artist.find params[:artist_id]

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
---
  def set_song
    @song = Song.find params[:id]